{
  "info": {
    "authors": [
      "Richard Loveless",
      "John R. Walker",
      "Aaron Dickerson",
      "Steven Marsh",
      "Ross Walker"
    ],
    "title": "How to Properly Clean a Beretta 40 Caliber Pistol",
    "description": "How to break down a Beretta 40 properly/safely and perform maintenance",
    "materials": [
      "Beretta 40 Caliber Pistol"
    ],
    "warnings": [
      "Please read and understand your local and federal laws before handling any weapon",
      "Follow all instructions in order",
      "Treat every weapon as if it were loaded",
      "Never point a weapon at anyone (including yourself)",
      "Keep the safety on until you intend to shoot",
      "Keep your finger straight and off the trigger until you intend to shoot"
    ]
  },
  "steps": {
    "1": {
     "title": "1. Safety First",
      "details": "The first thing you need to do when handling any weapon is the clear the weapon"
    },
    "2": {
      "title": "2. Ejecting Magazine",
      "details": "If there is a magazine in the M9 pistol, hit the quick release button to eject the magazine"
    },
    "3": {
      "title": "3. Ejecting Rounds",
      "details": "Point the weapon in a safe direction (facing away from you or anyone else) and pull the slide back to eject any rounds that may be in the chamber of the pistol"
    },
    "4": {
      "title": "4. Verifying Emptiness",
      "details": "Lock the slide to the rear and visually inspect the chamber of the pistol to make sure no round is still in the chamber"
    },
    "5": {
      "title": "5. Starting Breakdown",
      "details": "Once the weapon is clear, you can start breaking down the weapon to clean it"
    },
    "6": {
      "title": "6. Unlocking",
      "details": "Hit the release lock button and send the slide forward"
    },
    "7": {
      "title": "7. Derailing Slide",
      "details": "Pull the lever down and rack the slide back (as you pull the slide back, it will come off the rails)"
    },
    "8": {
      "title": "8. Releasing Tension",
      "details": "While still holding the slide, take the spring off to release the tension"
    },
    "9": {
      "title": "9. Removing Rod",
      "details": "Take the rod out of the spring"
    },
    "10": {
      "title": "10. Removing Barrel",
      "details": "Slide the barrel from the top part of the slide"
    },
    "11": {
      "title": "11. Cleaning",
      "details": "Now you can clean the weapon"
    },
    "12": {
      "title": "12. Returning Rod",
      "details": "Once you are done cleaning, you can put the rod back into the spring"
    },
    "13": {
      "title": "13. Returning Barrel",
      "details": "Slide the barrel back in the top part of the slide"
    },
    "14": {
      "title": "14. Returning Spring",
      "details": "Put the spring/rod in the grove under that barrel"
    },
    "15": {
      "title": "15. Relocking",
      "details": "Slide the top slide on the rails of the grip. Once it is pushed forward, push up on the level to lock it in place."
    }
  },
  "images": [
    "1.svg",
    "2.svg",
    "3.svg",
    "4.svg",
    "5.svg",
    "6.svg",
    "7.svg",
    "8.svg",
    "9.svg",
    "10.svg",
    "11.svg",
    "12.svg",
    "13.svg",
    "14.svg",
    "15.svg"
  ]
}
